## Reading in data

In [4]:
file = open('datasets/baby-names/NationalNames1.csv', 'r')

In [5]:
data = file.read()

In [12]:
print(data[0:100])

Id,Name,Year,Gender,Count
2,Anna,1880,F,2604
3,Emma,1880,F,2003
6,Margaret,1880,F,1578
10,Sarah,1880

In [14]:
print(repr(data[0:101]))

'Id,Name,Year,Gender,Count\n2,Anna,1880,F,2604\n3,Emma,1880,F,2003\n6,Margaret,1880,F,1578\n10,Sarah,1880,'

repr() takes in an input and returns a string output format without escape/special characters.

In [15]:
with open('datasets/baby-names/NationalNames1.csv', 'r') as file:
    data = file.read()
    data_lists = data.split("\n")
    
    list_of_lists = []
    for line in data_lists:
        row = line.split(';')
        list_of_lists.append(row)
        
print(list_of_lists[:20])

[['Id,Name,Year,Gender,Count'], ['2,Anna,1880,F,2604'], ['3,Emma,1880,F,2003'], ['6,Margaret,1880,F,1578'], ['10,Sarah,1880,F,1288'], ['11,Annie,1880,F,1258'], ['14,Florence,1880,F,1063'], ['26,Julia,1880,F,783'], ['28,Edith,1880,F,768'], ['30,Rose,1880,F,700'], ['36,Jessie,1880,F,635'], ['44,Lucy,1880,F,590'], ['45,Edna,1880,F,588'], ['53,Katherine,1880,F,502'], ['61,Ellen,1880,F,411'], ['68,Flora,1880,F,365'], ['69,Susie,1880,F,361'], ['74,Sadie,1880,F,317'], ['76,Katie,1880,F,303'], ['82,Alma,1880,F,277']]

In [20]:
import csv

dataList = list(csv.reader(open('datasets/baby-names/NationalNames1.csv'), \
                           delimiter=','))

In [21]:
print(dataList[:10])

[['Id', 'Name', 'Year', 'Gender', 'Count'], ['2', 'Anna', '1880', 'F', '2604'], ['3', 'Emma', '1880', 'F', '2003'], ['6', 'Margaret', '1880', 'F', '1578'], ['10', 'Sarah', '1880', 'F', '1288'], ['11', 'Annie', '1880', 'F', '1258'], ['14', 'Florence', '1880', 'F', '1063'], ['26', 'Julia', '1880', 'F', '783'], ['28', 'Edith', '1880', 'F', '768'], ['30', 'Rose', '1880', 'F', '700']]

In [28]:
subsetData = dataList[1:1000]

count_floats = []

for row in subsetData:
    count_flo = float(row[4])
    count_floats.append(count_flo)
    
count_floats[0:5]

[2604.0, 2003.0, 1578.0, 1288.0, 1258.0]

In [29]:
for row in subsetData:
    if row[3] == 'M':
        print(row[1])

George
Henry
Edward
Harry
Arthur
Fred
Louis
Charlie
Clarence
Lewis
Frederick
Roy
Tom
Martin
Herman
Francis
Harvey
Eugene
Edwin
Ben
Charley
Paul
Luther
Lawrence
Patrick
Oliver
August
Jack
Horace
Raymond
Warren
Ray
Anthony
Eddie
Dennis
Alonzo
Leon
Matthew
Levi
Moses
Everett
Winfield
Lloyd
Mack
Jay
Jess
Noah
Aaron
Alvin
Norman
Gilbert
Nelson
Jasper
Silas
Christopher
Mike
Percy
Reuben
Sylvester
Earnest
Otis
Willard
Jose
Elbert
Wiley
Emmett
Newton
Marvin
Ross
Edmund
Lon
Ora
Solomon
Clayton
Irving
Hubert
Bill
Chas
Lonnie
Byron
Edd
Emery
Jerome
Mose
Steve
Gordon
Pete
Orville
Lorenzo
Bob
Dock
Barney
Luke
Ike
Tony
Vincent
Emory
Isaiah
Ezra
Lucius
Spencer
Louie
Ned
Van
Ferdinand
Julian
Lyman
Pink
Ruben
Sanford
Ulysses
Walker
Wilbert
Archibald
Caleb
Earle
Laurence
Roger
Frederic
Madison
Karl
Wilfred
Alphonse
Dee
Johnny
Orin
Adrian
Ephraim
Fritz
Giles
Harris
Isom
Jonathan
Perley
Rolla
Sandy
Wilford
Leander
Boyd
Ezekiel
Issac
Orlando
Prince
Rollie
Rollin
Stuart
Dell
Egbert
Dean
Dorsey
Mahlon
Nat
Raleigh
Reginald
Rubin
Benjamine
Carey
Eldridge
Johnson
Mont
Pierre
Rex
Rodney
Wheeler
Al
Alvie
Augustine
Benjaman
Coleman
Duncan
Luis
Nels
Pat
Santiago
Sydney
Thaddeus
Thornton
Travis
Basil
Baxter
Bertrand
Buford
Gabe
Herschel
Hezekiah
Olin
Rolland
Turner
Almon
Denis
Doctor
Eric
Evans
Haywood
Hilliard
Hosea
Malachi
Orie
Shirley
Uriah
Waldo
Warner
Wong
Alden
Carson
Doc
Eben
Elige
Elizabeth
Freddie
Guss
Hamp
Isadore
Jones
Lacy
Leland
Minnie
Obie
Orrin
Oswald
Ramon
Aron
Ashley
Bernhard
Buster
Carleton
Clara
Clarance
Dolphus
Elder
Flem
Florence
Hoy
Ida
Lenard
Leopold
Manley
Odie
Oral
Orley
Press
Randall
Tilden
Worth
Bart
Benito
Billy
Bird
Claus
Cliff
Connie
Emmitt
Gene
Hollis
Ivey
Lyle
Mac
Mal
Rafael
Raoul
Rose
Shelton
Tobias
Walton
Adolf
Allison
Alpheus
Anastacio
Annie
Arlington
Asbury
Caesar
Candido
Clemente
Dora
Drew
Eliza
Elsie
Garry
Gustaf
Hallie
Holmes
Hope
Junious
Mervin
Milford
Oda
Ottis
Rafe
Redden
Rube
Ruby
Rupert
Salomon
Sanders
Thad
Titus
Tracy
Vernie
Wendell
Yee
Zeke
Abbott
Agustus
Albertus
Artie
Baldwin
Barnett
Bartholomew
Blaine
Boston
Brad
Bradford
Bradley
Cleo
Crockett
Elie
Eliga
Gee
Gottlieb
Gregory
Gustavus
Halsey
Hayden
Hermon
Humphrey
Ivy
Justice
Katherine
Leonidas
Lillie
Loran
Mace
Malcom
Manly
Matthias
Merida
Miner
Myrtle
Nate
Nora
Norval
Nova
Payton
Philo
Ransom
Reece
Sampson
Theadore
Tilmon
Vann
Wes
Winston
Woodie
Worthy
Wright
Zachariah
John
William
George
Henry
Arthur
Clarence
Joe
Jesse
Benjamin
Lewis
Frederick
Tom
Earl
Eugene
Bert
Claude
Michael
Ben
Ira
Harvey
Chester
Edwin
Luther

## Pandas!

In [30]:
import pandas as pd

with open('datasets/baby-names/NationalNames1.csv', 'r') as file:
    df = pd.read_csv(file)
    del df['Id']

In [31]:
df.head()

       Name  Year Gender  Count
0      Anna  1880      F   2604
1      Emma  1880      F   2003
2  Margaret  1880      F   1578
3     Sarah  1880      F   1288
4     Annie  1880      F   1258

In [32]:
df2 = pd.read_csv('datasets/baby-names/NationalNames1.csv')

In [33]:
df2.head()

   Id      Name  Year Gender  Count
0   2      Anna  1880      F   2604
1   3      Emma  1880      F   2003
2   6  Margaret  1880      F   1578
3  10     Sarah  1880      F   1288
4  11     Annie  1880      F   1258

## Filters

In [34]:
df[df['Name'] == 'Anna'].head()

      Name  Year Gender  Count
0     Anna  1880      F   2604
2751  Anna  1884      F   3860
5074  Anna  1887      F   4227
5683  Anna  1887      M     12
5848  Anna  1888      F   4982

In [36]:
df[(df['Name'] == 'James') & (df['Count'] > 6000) & (df['Count'] < 10000)]

        Name  Year Gender  Count
32142  James  1911      M   9951

## Sorting

In [37]:
df.sort_values(by = ['Name'], ascending = True).tail()

             Name  Year Gender  Count
431634   Zyshonne  1998      M     26
586226  Zytaevius  2012      M      5
607316   Zytaveon  2014      M      7
562931  Zytavious  2010      M      6
607762      Zyyon  2014      M      6